{
  "detailCard": {
    "title": "Details",
    "body": "The Energy Web Decentralized Operating System (EW-DOS) has three layers that work together to enable development and deployment of decentralized applications for the energy sector and beyond. \n\n Click on any box and you’ll be able to read a short description of the project here."
  },
  "data": [
    {
      "title": "Applications",
      "open": true,
      "disabled": true,
      "content": [
        {
          "title": "DER Management",
          "color": "#229AAA",
          "background": "#e8f5f6",
          "sectionColor": "#b7eaf1",
          "columns": 2,
          "open": false,
          "expandable": true,
          "sections": [
            {
              "title": "AEMO",
              "subtitle": "Project EDGE",
              "content": {
                "title": "Project EDGE",
                "body": "Project EDGE is a distributed energy resource marketplace in Eastern Australia where grid operators across the transmission and distribution interface can exchange grid services, such as requesting and buying the solar electricity stored in batteries of thousands of households across Australia to balance the grid.",
                "urls": {
                  "sources": [
                    "microsite: https://www.energyweb.org/aemo/",

                    "announcement : https://medium.com/energy-web-insights/aemo-announces-open-source-operating-system[…]orld-leading-distributed-energy-marketplace-design-a211a6f6c415",

                    "independent analysis: https://www.canarymedia.com/articles/solar/how-blockchain-could-help-integrate-rooftop-solar-and-evs-into-the-grid",

                    "article: https://medium.com/energy-web-insights/canary-in-the-sunshine-australia-is-showing-the-rest-of-the-world-what-a-modern-grid-looks-like-ce95832cc017"
                  ],
                  "readCaseStudy": "https://www.energyweb.org/case-studies/aemo/"
                }
              }
            },
            {
              "title": "CAISO",
              "subtitle": "FlexAlerts",
              "content": {
                "title": "FlexAlerts",
                "body": "Energy Web worked with CAISO (a major U.S. transmission grid operator) to enhance its existing Flex Alert program. With the new system, the public in California can subscribe to receive SMS or email alerts whenever the power grid faces a critical need for conservation. Subscribers can then respond when they intend to conserve, allowing CAISO to forecast the level of conservation—all while preserving the privacy of those subscribers.",
                "urls": {
                  "sources": [
                    "launch announcement: https://medium.com/energy-web-insights/california-grid-operator-launches-new-demand-flexibility-platform-enhancements-to-flex-alert-system-e01ae8030da0"
                  ]
                }
              }
            },
            {
              "title": "APG",
              "subtitle": "FlexHub",
              "content": {
                "title": "FlexHub",
                "body": "This proof of concept established that a decentralized platform can allow customer-sited energy assets (e.g., battery storage systems) to offer their flexibility into a frequency market, be activated when called on, deliver flexibility when activated, and be compensated for any flexibility provided.",
                "urls": {
                  "sources": [
                    "launch announcement: https://medium.com/energy-web-insights/austrian-power-grid-and-energy-web-foundation-launch-proof-of-concept-to-use-distributed-energy-d9a378f5f5ee"
                  ]
                }
              }
            },
            {
              "title": "Electra Caldense",
              "subtitle": "ElectraFlex",
              "content": {
                "title": "ElectraFlex",
                "body": "The ElectraFlex project is focusing on the deployment of a digital platform that will allow Electra Caldense to utilize the flexible capacity of assets connected to their electricity network. ElectraFlex is the world’s first decentralized flexibility platform tailored for the specific needs of a distribution system operator (DSO). The multi-faceted flexibility platform is using Energy Web’s EW-DOS technology stack to assign digital identities to all connected assets and flexibility market participants, allowing them to self-register in energy markets, and offer services to Electra Caldense as well as the Spanish transmission system operator (REE) on behalf of their owners.",
                "urls": {
                  "sources": [
                    "announcement: https://medium.com/energy-web-insights/catalonian-grid-operator-electra-caldense-energy-web-and-bamboo-energy-announce-grid-flexibility-51c75e5bcc25"
                  ]
                }
              }
            },
            {
              "title": "Fluvius + Bebat",
              "subtitle": "EasyBat",
              "content": {
                "title": "EasyBat",
                "body": "EasyBat is an open-source solution for decentralized lifecycle battery asset management. The solution is built on the Energy Web Decentralized Operating System (EW-DOS) open-source technology stack and focuses on the entire battery lifecycle. Original equipment manufacturers (OEMs), distributors, installers, and accredited inspection and certification organizations issue and verify every relevant asset transaction. The fact that all these entities work together on a shared decentralized ecosystem is an important and never-seen-before innovation. Partners involve Bebat, the Belgian battery compliance scheme and Fluvius, the electricity and natural gas distribution system operator (DSO) for the Flemish Region of Belgium.",
                "urls": {
                  "sources": [
                    "EasyBat prototype: https://www.energyweb.org/technology/applications/ew-switchboard/easybat/",

                    "launch announcement: https://medium.com/energy-web-insights/bebat-launches-easybat-an-open-source-decentralized-solution-for-battery-lifecycle-management-281f2ace61e9"
                  ]
                }
              }
            },
            {
              "title": "DENA",
              "subtitle": "Identity registry",
              "content": {
                "title": "Identity registry",
                "body": "Germany’s federal energy agency, Deutsche Energie-Agentur (DENA), has selected Energy Web to design and construct a digital registry for distributed energy resources (DERs) across the country in partnership with more than 20 industry players. The project will enable energy assets in Germany, such as thermostats, solar PV systems, batteries, and electric vehicle charging stations to undertake automatic registration with a decentralized ledger of identities, allowing their utilisation by the German grid for a range of services such as virtual power plants and frequency regulation.",
                "urls": {
                  "sources": [
                    "announcement: https://medium.com/energy-web-insights/dena-selects-energy-web-to-build-prototype-identity-registry-for-germanys-energy-market-2580f53b2d20"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "FlexRunner IOT Firmware",
              "content": {
                "title": "FlexRunner IOT Firmware",
                "body": "Flex Runner is a modular framework for IoT devices. The project aims to make IoT devices more maintainable, manageable and smart by using small applications, called Flex Actions, assigned to workflow documents, called Flex Workflows. These Flex Actions allow users to create automations based on the readings of their IOT submeter. To better understand the concept, you can think of Flex Runner as ‘GitHub Actions running on an IoT device’"
              }
            }
          ]
        },
        {
          "title": "E-Mobility",
          "color": "#0BA740",
          "background": "#e6f6ec",
          "sectionColor": "#58F48D",
          "expandable": true,
          "open": false,
          "sections": [
            {
              "title": "Elia",
              "subtitle": "E-Mobility Dashboard",
              "content": {
                "title": "E-Mobility Dashboard",
                "body": "An open platform to simplify the identification of electric vehicles and charge points through digital identities anchored on the Energy Web Chain, enabling all parties to get trustworthy, live and historic data from devices, improving green electricity purchasing and enabling the emergence of other energy services and opportunities for owners and energy companies",
                "urls": {
                  "sources": [
                    "partnership announcement: https://medium.com/energy-web-insights/elia-group-and-energy-web-launch-multi-year-strategic-partnership-be2c5d87395f"
                  ],
                  "readCaseStudy": "https://www.energyweb.org/case-studies/e-mobility/"
                }
              }
            },
            {
              "title": "VW",
              "subtitle": "Smart Green Charging",
              "content": {
                "title": "Smart Green Charging",
                "body": "A partnership to investigate digitalization and integration of electric vehicles (EVs) and charging infrastructure in support of advanced electric vehicle charging programs and markets globally.\nImagine every vehicle can participate in clean electricity markets around the globe and receive energy from local and trustworthy sources. In order to make this vision a reality Energy Webs green charging solution brings energy and e-mobility companies together to offer reliable and verifiable green charging anywhere in world.",
                "urls": {
                  "sources": [
                    "announcement: https://medium.com/energy-web-insights/energy-web-and-volkswagen-jointly-investigate-the-potential-of-blockchains-for-energy-market-97e6bd687fee"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "OCN",
              "content": {
                "title": "OCN",
                "body": "Share&Charge’s OCN is a decentralized e-roaming solution for seamless electric vehicle (EV) charging across different charge point networks. Since March 2020, the OCN has migrated onto the EnergyWeb Chain and is now a fully decentralized application on the EW network.",
                "urls": {
                  "sources": [
                    "announcement: https://medium.com/energy-web-insights/share-charge-foundation-launches-open-charging-network-on-energy-web-chain-84af7f6f5b3c"
                  ]
                }
              }
            }
          ]
        },
        {
          "title": "Traceability",
          "color": "#E4A001",
          "background": "#fcf5e5",
          "sectionColor": "#FEC43D",
          "open": false,
          "expandable": true,
          "sections": [
            {
              "title": "",
              "subtitle": "Zero",
              "content": {
                "title": "Zero",
                "body": "Zero will be a global search engine for renewable energy certificates and other decarbonization products, that are tokenized on the EW Chain. The goal is to simplify procurement processes, increase transparency about available options, and accelerate decarbonization by matching buyers and sellers across the globe.",
                "urls": {
                  "sources": [
                    "Zero for Filecoin and Crypto Miners: https://medium.com/energy-web-insights/protocol-labs-and-energy-web-complete-first-showcase-of-an-open-source-solution-to-decarbonize-1a8c22ac02f5",

                    "announcement: https://medium.com/energy-web-insights/energy-web-awarded-good-energies-foundation-grant-for-new-global-renewables-marketplace-794eaa7e14e0"
                  ],
                  "readCaseStudy": "https://www.energyweb.org/case-studies/aemo/"
                }
              }
            },
            {
              "title": "",
              "subtitle": "Origin",
              "content": {
                "title": "Origin",
                "body": "Origin is a production-ready digital marketplace for renewable energy certificates. \n\n EW Deployed several instances of Origin for different partners in different geographies, including:\n\n- PTT in Thailand:\nPTT and EW cooperated to build a production-ready digital marketplace for renewable energy certificates in Thailand, in line with the I-REC Standard.\n\n- Foton in Turkey:\nFoton and EW cooperated to build a production-ready digital marketplace for renewable energy certificates in Turkey in line with the I-REC Standard. The marketplace is up and running and accessible to renewable energy buyers and sellers.\n\n- PJM in 14 US States:\nPJM and EW cooperated in a year-long partnership to test blockchain-based tools (including the Origin SDK) for creating a digital marketplace for voluntary RECs.\n\n- NV Energy in Nevada, USA:\nEW, Blockchains LLC and the Public Utility Commission (PUC) of Nevada cooperated in testing blockchain-based technologies, including the Origin SDK and its issuer module, for creating a modern tracking system for Nevada's renewable energy certificates (\"PECs\").",
                "urls": {
                  "sources": [
                    "PTT announcement: https://energyweb.org/2019/09/11/ptt-and-energy-web-foundation-launch-blockchain-based-renewables-platform-for-thailand-asean-japan/",

                    "PJM announcement: https://medium.com/energy-web-insights/pjm-eis-update-modernizing-a-legacy-u-s-rec-tracking-system-with-blockchain-based-technology-db0ad5a4f924",

                    "PJM EIS press release: https://insidelines.pjm.com/pjm-eis-completes-blockchain-pilot-with-energy-web-foundation",

                    "Foton announcement: https://medium.com/energy-web-insights/foton-and-energy-web-launch-blockchain-based-i-rec-marketplace-in-turkey-e2847db835f",

                    "NV Energy announcement: https://medium.com/energy-web-insights/nv-energy-blockchains-llc-and-energy-web-announce-blockchain-pilot-for-nevadas-residential-bbf4571179da"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "24/7",
              "content": {
                "title": "24/7",
                "body": "24/7 Explainer"
              }
            }
          ]
        },
        {
          "title": "DeFi",
          "color": "#DE0862",
          "background": "#fce6ef",
          "sectionColor": "#F9559A",
          "open": false,
          "expandable": true,
          "sections": [
            {
              "title": "ENGIE",
              "subtitle": "DeFi 4 Energy Access",
              "content": {
                "title": "DeFi 4 Energy Access",
                "body": "ENGIE Energy Access — one of the leading off-grid, Pay-As-You-Go (PAYG) solar and mini-grid solutions providers in Africa, has partnered with Energy Web to accelerate energy access in sub-Saharan Africa through a decentralized finance (DeFi) crowdfunding platform. The DeFi application will be built on the open-source Energy Web tech stack and enable investors to provide microloans that support clean energy deployment.",
                "urls": {
                  "sources": [
                    "project page: https://lab.energyweb.org/engie-energy-access/",

                    "project announcement: https://medium.com/energy-web-insights/engie-energy-access-and-energy-web-announce-defi-crowdfunding-platform-to-help-scale-solar-mini-2142029ad84f#:~:text=Energy%20Web%20is%20a%20global,participate%20in%20any%20energy%20market."
                  ]
                }
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Infrastructure",
      "open": true,
      "disabled": true,
      "content": [
        {
          "title": "Identity Solutions",
          "color": "#006CF0",
          "sectionColor": "#006CF0",
          "fullWidth": true,
          "columns": 3,
          "open": false,
          "expandable": true,
          "sections": [
            {
              "title": "",
              "subtitle": "Switchboard",
              "content": {
                "title": "Switchboard",
                "body": "Switchboard is the identity and access management (IAM) interface for the Energy Web ecosystem. Its purpose is similar to centralized IAM services offered by Amazon or Google in that it allows you to define what users can do within and organization or an application.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/foundational-concepts/self-sovereign-identity#decentralized-identifiers-dids"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "DIDs",
              "content": {
                "title": "DIDs",
                "body": "A DID is a digital, verifiable identity that is user-generated and not coupled to any centralized institution. It can be used to identify any subject, such as an asset (all DERs - Distributed Energy Resources - such as solar panels, batteries, electric vehicles, smart appliances etc), a person, or an organization.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/foundational-concepts/self-sovereign-identity#decentralized-identifiers-dids"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "IAM Client Lib",
              "content": {
                "title": "IAM Client Lib",
                "body": "A package that provides high-level functions related to the identity and access management (IAM) for all users, assets, organizations and applications that are anchored on the Energy Web Chain. It can be integrated into existing client or backend code bases.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/technology/the-stack/utility-layer-1#identity-access-and-management-iam-client-library"
                  ]
                }
              }
            }
          ]
        },
        {
          "title": "Utility Layer",
          "color": "#7907FE",
          "sectionColor": "#A466FF",
          "columns": 4,
          "open": false,
          "fullWidth": true,
          "expandable": true,
          "sections": [
            {
              "title": "",
              "subtitle": "DSB Messaging",
              "content": {
                "title": "DSB Messaging",
                "body": "A pub/sub messaging service for high-volume, low latency (machine-to-machine) communications that is integrated with the Energy Web Chain.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/technology/the-stack/utility-layer-1#decentralized-service-bus-dsb"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "Cache Server for Blockchain data",
              "content": {
                "title": "Cache Server for Blockchain data",
                "body": "A server that caches smart contract data in order to improve read-query performance for applications and packages that rely on data from the Energy Web Chain.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/technology/the-stack/utility-layer-1#identity-access-and-management-iam-cache-server"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "Staking",
              "content": {
                "title": "Staking",
                "body": "A model that supports service providers who are provisioning instances of Energy Web software services and applications. Vetted Providers will offer Energy Web software as a service and be eligible to attract additional staking deposits from patrons who want to back the Providers.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/token/staking"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "Watchtower",
              "content": {
                "title": "Watchtower",
                "body": "Watchtower Explainer"
              }
            },
            {
              "title": "",
              "subtitle": "EWNS Name Service",
              "content": {
                "title": "EWNS Name Service",
                "body": "A naming system for the Energy Web Chain ecosystem based on the Ethereum Name Service. It allows dapp users users to create human-readable, user-friendly names for blockchain identifiers and to reserve domain names for Energy Web applications.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/how-tos-and-tutorials/using-the-ethereum-name-service-ens"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "EKC- Enterprise Key Connect",
              "content": {
                "title": "EKC- Enterprise Key Connect",
                "body": "A utility which allows enterprise employees to use established identity providers, like Azure AD, to access the key storage provided by key management systems, such as Azure Key Vault, within web3 applications."
              }
            },
            {
              "title": "",
              "subtitle": "ETH<>EWC Bridge",
              "content": {
                "title": "ETH<>EWC Bridge",
                "body": "ETH<>EWC Bridge Explainer",
                "urls": {
                  "sources": [
                    "Read more: https://app.gitbook.com/o/-MaVNTC0phnhS2JhwPF0/s/-M_pXALj14Egb-5Bal_p/token/token-bridge"
                  ]
                }
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Trust Layer",
      "open": false,
      "content": [
        {
          "title": "Energy Web Chain & Tools",
          "color": "#FFFFFF",
          "sectionColor": "#A466FF",
          "fullWidth": true,
          "background": "#d2b3ff",
          "columns": 4,
          "open": false,
          "expandable": true,
          "sections": [
            {
              "title": "",
              "subtitle": "Energy Web Chain",
              "background": "#A466FF",
              "color": "#FFFFFF",
              "selected": {
                "color": "#A466FF"
              },
              "content": {
                "title": "Energy Web Chain",
                "body": "An open-source, Proof-of-Authority public blockchain derived from Ethereum blockchain technology. Provides the trust mechanism for EW-DOS and the DID registry through smart contracts. ",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/technology/the-stack/trust-layer-energy-web-chain"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "EWT",
              "color": "#ffffff",
              "background": "#A466FF",
              "selected": {
                "color": "#A466FF"
              },
              "content": {
                "title": "EWT",
                "body": "The Energy Web Chain's native utility token. Tokens are used in EW-DOS to pay for gas fees associated for on-chain transactions. ",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/token/energy-web-token"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "Validator Nodes",
              "color": "#ffffff",
              "background": "#A466FF",
              "selected": {
                "color": "#A466FF"
              },
              "content": {
                "title": "Validator Nodes",
                "body": "A defined set of actors that validate transactions and propagate new blocks to the Energy Web Chain. Validators take turns creating new blocks in a round-robin style.",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/technology/the-stack/trust-layer-energy-web-chain/system-architecture/proof-of-authority-consensus-mechanism#proof-of-authority-consensus"
                  ]
                }
              }
            },
            {
              "title": "",
              "subtitle": "Block Explorer",
              "color": "#ffffff",
              "background": "#A466FF",
              "selected": {
                "color": "#A466FF"
              },
              "content": {
                "title": "Block Explorer",
                "body": "An interface that provides the most important on-chain information about blocks, transactions, accounts and Energy Web Token (EWT).",
                "urls": {
                  "sources": [
                    "Read more: https://energy-web-foundation.gitbook.io/energy-web/technology/the-stack/trust-layer-energy-web-chain/block-explorer"
                  ]
                }
              }
            }
          ]
        }
      ]
    }
  ]
}
